export const fetchAboutPageData = async () => {
  const data = {
    aboutUs: {
      _id: "1",
      imageSection: {
        _id: "1",
        header: "מי אנחנו?",
        desc: "LevelUp היא סוכנות דיגיטלית המתמחה במתן פתרונות דיגיטליים יצירתיים ומקצועיים לעסקים. אנו כאן כדי לעזור לך לקחת את העסק שלך לשלב הבא בעזרת כלים טכנולוגיים מתקדמים שיביאו תוצאות מיידיות וארוכות טווח.",
        alt: "About Us image",
        src: "https://res.cloudinary.com/dudwjf2pu/image/upload/v1732822552/45176455_9151730_zok7cd.jpg",
      },
      paragraph: {
        _id: "1",
        header: "החזון שלנו",
        desc: "המטרה שלנו היא להיות אחת הסוכנויות המובילות בתחום הדיגיטל בישראל, ולהציע ללקוחותינו את הפתרונות הדיגיטליים המתקדמים ביותר בשוק. אנחנו לא רק בונים אתרים – אנחנו בונים את העתיד של העסק שלך.",
      },
    },
    ourStory: {
      _id: "1",
      header: "המחלקות שלנו",
      paragraphs: [
        {
          _id: "1",
          header: "פיתוח ובניית אתרים",
          desc: "האתר שלך הוא הפנים של העסק – אנחנו ב-LevelUp יודעים איך ליצור אתר סוחף ומרשים שיגרום לגולשים שלך להתעניין ולהפוך ללקוחות. במחלקת הפיתוח שלנו, אנו מתמחים ביצירת אתרים מותאמים אישית בקוד, שמספקים גמישות מלאה ועונים על כל הצרכים של העסק שלך. אנחנו בונים אתרים שלא רק נראים מצוין, אלא גם פועלים בצורה מיטבית, תוך שמירה על חוויית משתמש מעולה, ביצועים מהירים ויכולת להתרחב בעת הצורך. אם אתה רוצה אתר שייצג אותך בצורה הטובה ביותר, אנחנו כאן כדי להגשים את זה.",
        },
        {
          _id: "2",
          header: "עיצוב UI\UX",
          desc: "העיצוב הוא יותר מאשר רק איך האתר נראה – הוא איך הוא מרגיש למשתמשים שלך. במחלקת העיצוב שלנו, אנחנו מתמקדים ביצירת חוויית משתמש יעילה שמניעה לפעולה. אנו נותנים דגש מהעיצוב הראשוני ועד לפרטים הקטנים ביותר, אנחנו יוצרים אתרים שמלאים בתשומת לב לצרכים של המשתמשים ומביאים את המיתוג שלך לידי ביטוי בצורה הטובה ביותר. כל החלטת עיצוב נעשית עם מחשבה על הדרך שבה הלקוח יגיב – אנחנו הופכים את החוויה המקוונת של העסק שלך לאינטואיטיבית, נוחה ויעילה.",
        },
        {
          _id: "3",
          header: "שיווק ופרסום",
          desc: "אתר מקצועי שנראה טוב זאת התחלה מעולה – אחנו רוצים שהאתר הזה גם יביא תוצאות. במחלקת השיווק והפרסום שלנו, אנחנו גם דואגים שהעסק שלך יגיע לקהל היעד הנכון. אנחנו מתמחים בשירותי SEO, קמפיינים ממומנים בגוגל, פייסבוק ואינסטגרם, ניהול תוכן ברשתות החברתיות ויצירת לידים חמים ואיכותיים שמחכים רק לך. אנחנו בונים משפכים ואסטרטגיות שיווקיות שמותאמות בדיוק לצרכים של העסק שלך ושיגרמו למתעניינים להגיע בלי הפסקה.",
        },
        {
          _id: "4",
          header: "שירות ותמיכה לאורך הדרך",
          desc: "ההצלחה שלך לא מסתיימת עם השקת האתר, אנחנו כאן כדי לוודא שהעסק שלך תמיד מוכן להמשיך לצמוח. עם השירות והתמיכה שלנו, אנחנו מספקים עזרה אישית ואנושית לאורך כל הדרך. אם יש לך שאלות, צריך עזרה בשדרוג האתר, או סתם רוצה לדעת איך לשפר את ביצועי האתר שלך, אנחנו כאן בשבילך. אנחנו לא רק בונים את האתר שלך – אנחנו תומכים בו, מייעצים, ומוודאים שהכל מתפקד בצורה מושלמת, כך שתוכל להמשיך להתמקד בהצלחת העסק שלך.",
        },
      ]
    },
    aboutUsSummary: {
      _id: "1",
      paragraph: {
        _id: "1",
        header: 'אנחנו כאן כדי לקחת אותך לשלב הבא, דבר המנכ"ל: ',
        desc: '"ב-LevelUp אנחנו שמים את הלקוח במרכז, ומבינים שהעסק המקוון שלך הוא הרבה יותר מאתר אינטרנט – זה צינור משמעותי שיכול להשפיע על העתיד. לכן, כל פתרון שאנחנו מספקים מותאם במיוחד כדי להבטיח תוצאות אמיתיות לאורך זמן."',
      },
      ctaParagraph: {
        _id: "1",
        header: "מה עכשיו?",
        desc: "אם אתה מוכן לקחת את העסק שלך לשלב הבא, השאר פרטים עכשיו ונשמח לתכנן יחד את הדרך להצלחה הדיגיטלית שלך!",
        buttonText: "צור קשר",
      }
    }
  }

  return data
};
